{
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            1000,
            12
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_1"
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "activation": "relu"
        }
      },
      {
        "class_name": "MaxPooling1D",
        "config": {
          "name": "max_pooling1d",
          "pool_size": [
            2
          ],
          "strides": [
            2
          ],
          "padding": "valid"
        }
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_1",
          "filters": 128,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "activation": "relu"
        }
      },
      {
        "class_name": "MaxPooling1D",
        "config": {
          "name": "max_pooling1d_1",
          "pool_size": [
            2
          ],
          "strides": [
            2
          ],
          "padding": "valid"
        }
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "units": 256,
          "activation": "relu"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "rate": 0.5
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "units": 71,
          "activation": "sigmoid"
        }
      }
    ]
  }
}